cf_billing/Documents/энргУстановитьНормуПотребленияПоУслуге.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>энргУстановитьНормуПотребленияПоУслуге</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>InformationRegister.энргЗначенияНормативовПотребления</xr:Item>
				<xr:Item>InformationRegister.энргЗначенияСоциальныхНормативов</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Район</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргЗоныОтвественности</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипНачисления</Name>
					<Type>
						<v8:Type>cfg:EnumRef.энргТипыНачислений</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Примечание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Услуга</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргВидыУслуг</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаФактическогоСобытия</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НаправлениеИспользованияТУ</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргНаправлениеИспользованияТочекУчета</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДокументОснование</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СписокРайонов</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ЗначенияНормативов</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>КлючНорматива</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.энргКлючиНормативов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЗначениеНорматива</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>6</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ЗначенияСоциальныхНормативов</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>КлючНорматива</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.энргКлючиНормативов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЗначениеНорматива</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>6</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ЗначенияНормативовСписокРайонов</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Район</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.энргЗоныОтвественности</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КлючНорматива</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.энргКлючиНормативов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЗначениеНорматива</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>6</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ЗначенияСоциальныхНормативовСписокРайонов</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Район</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>10</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КлючНорматива</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.энргКлючиНормативов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЗначениеНорматива</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>6</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

cf_billing/InformationRegisters/энргСпособыРасчетаПоНаправлениям.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>энргСпособыРасчетаПоНаправлениям</Name>
			<InformationRegisterPeriodicity>Month</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ВидПлощади</Name>
					<Type>
						<v8:Type>cfg:EnumRef.энргВидыПлощадей</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Сезонность</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргВидыСезонности</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НормативПоДням</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СпособОпределенияСоциальнойНормы</Name>
					<Type>
						<v8:Type>cfg:EnumRef.энргСпособыОпределенияСоциальнойНормы</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>УдалитьСезонностьПеречисление</Name>
					<Type>
						<v8:Type>cfg:EnumRef.УдлаитьэнргВидыСезонности</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НачислятьЗаПолныйМесяц</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СпособРасчетаНорматива</Name>
					<Type>
						<v8:Type>cfg:EnumRef.энргСпособРасчетаНорматива</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СпособРасчетаСоциальногоНорматива</Name>
					<Type>
						<v8:Type>cfg:EnumRef.энргСпособРасчетаНорматива</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НормативПоЧасам</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ЗнаменательЕдиницыИзмерения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргЕдиницыИзмерения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Район</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргЗоныОтвественности</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Услуга</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргВидыУслуг</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>НаправлениеИспользованияТУ</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргНаправлениеИспользованияТочекУчета</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

cf_billing/InformationRegisters/энргУстановленныеПараметрыРасчетаНорматива.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>энргУстановленныеПараметрыРасчетаНорматива</Name>
			<InformationRegisterPeriodicity>Year</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Район</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргЗоныОтвественности</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ТипНачисления</Name>
					<Type>
						<v8:Type>cfg:EnumRef.энргТипыНачислений</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Услуга</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргВидыУслуг</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Разрез</Name>
					<Type>
						<v8:Type>cfg:EnumRef.энргКлючевыеПараметрыНорматива</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>НаправлениеИспользованияТУ</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргНаправлениеИспользованияТочекУчета</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СоциальныйНорматив</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

cf_billing/Enums/энргКлючевыеПараметрыНорматива.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>энргКлючевыеПараметрыНорматива</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ВидБлагоустройства</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВидСобственности</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ГодПостройки</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КоличествоКомнат</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КоличествоЧеловек</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КоличествоЭтажей</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ИзмерительНаправленияИспользования</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ТипМестности</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ТипПлиты</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОбщаяПлощадьМОПНаЧеловека</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КоличествоСобственников</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КоличествоПрописанных</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КоличествоПроживающих</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

cf_billing/Enums/энргТипыНачислений.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>энргТипыНачислений</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ИндивидуальныеНачисления</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОбщедомовыеНачисления</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОтдельностояющиеОбъекты</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЮридическиеЛица</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

cf_billing/Documents/энргУстановитьНормуПотребленияПоУслуге/Forms/ФормаДокумента/Ext/Form/Module.bsl
#Область СобытияФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	энргЛокализацияСервер.ПриСозданииНаСервере_энргУстановитьНормуПотребленияПоУслуге(ЭтотОбъект);
	// ВводНаОсновании
	ВводНаОсновании.ПриСозданииНаСервере(ЭтотОбъект, Элементы.ПодменюСоздатьНаОсновании);
	// Конец ВводНаОсновании

	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПараметрыРазмещения = ПодключаемыеКоманды.ПараметрыРазмещения();
	ПараметрыРазмещения.КоманднаяПанель = Элементы.ПодменюОтчеты;
	ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект, ПараметрыРазмещения);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

	Если Не ЗначениеЗаполнено(Объект.Ссылка)
		И ЗначениеЗаполнено(Объект.Район)
		И ЗначениеЗаполнено(Объект.Услуга)
		И ЗначениеЗаполнено(Объект.Организация)
		И ЗначениеЗаполнено(Объект.ТипНачисления)   Тогда
		СоздатьРеквизитыКлючевыхПараметровСервер(Объект);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	// СтандартныеПодсистемы.ДатыЗапретаИзменения
	ДатыЗапретаИзменения.ОбъектПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект);
	// Конец СтандартныеПодсистемы.ДатыЗапретаИзменения
	
	
	Если ЗначениеЗаполнено(ТекущийОбъект.Район)
		И ЗначениеЗаполнено(ТекущийОбъект.Услуга)
		И ЗначениеЗаполнено(ТекущийОбъект.Организация)
		И ЗначениеЗаполнено(ТекущийОбъект.ТипНачисления)  Тогда
		
		СоздатьРеквизитыКлючевыхПараметровСервер(ТекущийОбъект);
	КонецЕсли;	
	
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	СтруктураЭлементов = Новый Структура("КлючевыеПараметры, КлючевыеПараметрыСоцНорматива", СписокКлючевыхПараметров, СписокКлючевыхПараметровСоцНорматива);
	КлючевыеПараметрыНорматива			= Перечисления.энргКлючевыеПараметрыНорматива.ОписаниеКлючевыхПараметров();
	
	Для Каждого ТекЭлемент Из СтруктураЭлементов Цикл
		ДанныеСтрок  						= Новый Массив;
		
		Для Каждого СтрокаНорматива Из ЭтаФорма[ТекЭлемент.Ключ] Цикл
			ОписаниеСтроки 					= Новый Структура;
			
			Для Каждого КлючевойПараметр Из ТекЭлемент.Значение Цикл
				Если КлючевойПараметр.Значение = Перечисления.энргКлючевыеПараметрыНорматива.ПустаяСсылка() ТОгда
					Продолжить;
				КонецЕсли;			
				ОписаниеПараметра 		 	= КлючевыеПараметрыНорматива[КлючевойПараметр.Значение];			
				
				Если ОписаниеПараметра.Диапазон Тогда
					ОписаниеСтроки.Вставить(ОписаниеПараметра.Имя + "От", СтрокаНорматива[ОписаниеПараметра.Имя + "От"]);
					ОписаниеСтроки.Вставить(ОписаниеПараметра.Имя + "До", СтрокаНорматива[ОписаниеПараметра.Имя + "До"]);
				Иначе
					ОписаниеСтроки.Вставить(ОписаниеПараметра.Имя, СтрокаНорматива[ОписаниеПараметра.Имя]);
				КонецЕсли;			
			КонецЦикла; 		
			ДанныеСтрок.Добавить(ОписаниеСтроки);
		КонецЦикла;
		
		КлючиНормативов 					= Справочники.энргКлючиНормативов.НайтиИлиСоздатьКлючПараметра(ДанныеСтрок, Отказ);
		
		Если Отказ Тогда
			//Дубли Ключей
			ТекстСообщения = "";
			Для каждого стр из КлючиНормативов Цикл
				ТекстСообщения = ТекстСообщения + "Для строки №" + стр.Индекс + " найден пересекающийся ключ норматива " + стр.Дубль + "; " + Символы.ПС;
			КонецЦикла;
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
			Возврат;
		КонецЕсли;
		
		Если ТекЭлемент.Ключ = "КлючевыеПараметры" Тогда
			ТабЧасть	= ТекущийОбъект.ЗначенияНормативов;
		Иначе
			ТабЧасть	= ТекущийОбъект.ЗначенияСоциальныхНормативов;
		КонецЕсли;
		ТабЧасть.Очистить();
		
		Для Сч = 0 По КлючиНормативов.ВГраница() Цикл
			СтрокаЗначения 						= ТабЧасть.Добавить();
			СтрокаЗначения.КлючНорматива 		= КлючиНормативов[Сч];
			СтрокаЗначения.ЗначениеНорматива 	= ЭтаФорма[ТекЭлемент.Ключ][Сч].ЗначениеНорматива;		   
		КонецЦикла;
	КонецЦикла; 
	
КонецПроцедуры

#КонецОбласти

#Область СобытияЭлементовШапки

&НаКлиенте
Процедура УслугаПриИзменении(Элемент)
	СоздатьРеквизитыКлючевыхПараметровКлиент();
КонецПроцедуры

&НаКлиенте
Процедура РайонПриИзменении(Элемент)
	СоздатьРеквизитыКлючевыхПараметровКлиент();
КонецПроцедуры

&НаКлиенте
Процедура ТипНачисленияПриИзменении(Элемент)
	СоздатьРеквизитыКлючевыхПараметровКлиент();
КонецПроцедуры

&НаКлиенте
Процедура НаправлениеИспользованияТУПриИзменении(Элемент)
	СоздатьРеквизитыКлючевыхПараметровКлиент();
КонецПроцедуры

&НаКлиенте
Процедура НаправлениеИспользованияТУНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	энргРаботаСТочкамиУчетаКлиент.ОткрытьФормуВыбораНаправленийИзмерителейТУ(Элемент,СтандартнаяОбработка);
КонецПроцедуры

#КонецОбласти


#Область ОбработчикиКомандФормы

// ВводНаОсновании
&НаКлиенте
Процедура Подключаемый_ВыполнитьКомандуСоздатьНаОсновании(Команда)
	
	ВводНаОснованииКлиент.ВыполнитьПодключаемуюКомандуСоздатьНаОсновании(Команда, ЭтотОбъект, Объект);
	
КонецПроцедуры
// Конец ВводНаОсновании

// СтандартныеПодсистемы.ПодключаемыеКоманды
&НаКлиенте
Процедура Подключаемый_ВыполнитьКоманду(Команда)
	МодульПодключаемыеКомандыКлиент = ОбщегоНазначенияКлиент.ОбщийМодуль("ПодключаемыеКомандыКлиент");
	МодульПодключаемыеКомандыКлиент.ВыполнитьКоманду(ЭтотОбъект, Команда, Объект);
КонецПроцедуры

&НаСервере
Процедура Подключаемый_ВыполнитьКомандуНаСервере(Контекст, Результат) Экспорт
	МодульПодключаемыеКоманды = ОбщегоНазначения.ОбщийМодуль("ПодключаемыеКоманды");
	МодульПодключаемыеКоманды.ВыполнитьКоманду(ЭтотОбъект, Контекст, Объект, Результат);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОбновитьКоманды()
	МодульПодключаемыеКомандыКлиентСервер = ОбщегоНазначенияКлиент.ОбщийМодуль("ПодключаемыеКомандыКлиентСервер");
	МодульПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
КонецПроцедуры
// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

#КонецОбласти

#Область ВспомогательныеПроцедурыИФункции

&НаКлиенте
Процедура СоздатьРеквизитыКлючевыхПараметровКлиент()
	
	Если НЕ ЗначениеЗаполнено(Объект.Район)
		Или НЕ ЗначениеЗаполнено(Объект.Услуга)
		Или НЕ ЗначениеЗаполнено(Объект.Организация)
		Или НЕ ЗначениеЗаполнено(Объект.ТипНачисления)   Тогда
		
		ВидПлощадиУслуги = ПредопределенноеЗначение("Перечисление.энргВидыПлощадей.ПустаяСсылка");
		
		Возврат;
	КонецЕсли;
	
	КлючевыеПараметры.Очистить();
	КлючевыеПараметрыСоцНорматива.Очистить();
	
	СоздатьРеквизитыКлючевыхПараметровСервер();
	
КонецПроцедуры

&НаСервере
Процедура СоздатьРеквизитыКлючевыхПараметровСервер(ТекущийОбъект = Неопределено) 
	
	Если ТекущийОбъект = Неопределено Тогда
		ТекущийОбъект 						= Объект;
		ЗаполнятьЗначенияПараметров 		= Ложь;
	КонецЕсли;
	Если НЕ ТекущийОбъект.ПометкаУдаления Тогда 
		ЗаполнятьЗначенияПараметров = Истина;
		
	Иначе  
		ЗаполнятьЗначенияПараметров = Ложь;
	КонецЕсли;
	
	Если ТекущийОбъект.ТипНачисления = Перечисления.энргТипыНачислений.ИндивидуальныеНачисления и (НЕ ЗначениеЗаполнено(ТекущийОбъект.НаправлениеИспользованияТУ) ИЛИ ТекущийОбъект.НаправлениеИспользованияТУ = Справочники.энргНаправлениеИспользованияТочекУчета.ОсновноеНаправление) Тогда
		ВидПлощадиУслуги 					= ТекущийОбъект.Услуга.ВидПлощади;
		СпособыРасчетаПоНаправлениям 		= РегистрыСведений.энргСпособыРасчетаПоНаправлениям.СрезПоследних(Объект.Дата,Новый Структура("Организация, Район, Услуга, НаправлениеИспользованияТУ", ТекущийОбъект.Организация, ТекущийОбъект.Район, ТекущийОбъект.Услуга, ТекущийОбъект.НаправлениеИспользованияТУ));
		ЕдиницаИзмеренияЗнаменатель 		= Справочники.энргЕдиницыИзмерения.ПустаяСсылка();
		Если НЕ СпособыРасчетаПоНаправлениям.Количество() = 0 Тогда
			ЕдиницаИзмеренияЗнаменатель 	= СпособыРасчетаПоНаправлениям[0].ЗнаменательЕдиницыИзмерения;	
		КонецЕсли;		
	ИначеЕсли ТекущийОбъект.ТипНачисления = Перечисления.энргТипыНачислений.ИндивидуальныеНачисления Тогда
		СпособыРасчетаПоНаправлениям 		= РегистрыСведений.энргСпособыРасчетаПоНаправлениям.СрезПоследних(Объект.Дата,Новый Структура("Организация, Район, Услуга, НаправлениеИспользованияТУ", ТекущийОбъект.Организация, ТекущийОбъект.Район, ТекущийОбъект.Услуга, ТекущийОбъект.НаправлениеИспользованияТУ));
		ЕдиницаИзмеренияЗнаменатель 		= Справочники.энргЕдиницыИзмерения.ПустаяСсылка();
		ВидПлощадиУслуги 					= Перечисления.энргВидыПлощадей.ПустаяСсылка();
		Если НЕ СпособыРасчетаПоНаправлениям.Количество() = 0 Тогда
			ВидПлощадиУслуги 				= СпособыРасчетаПоНаправлениям[0].ВидПлощади;
			ЕдиницаИзмеренияЗнаменатель 	= СпособыРасчетаПоНаправлениям[0].ЗнаменательЕдиницыИзмерения;	
		КонецЕсли;		
	ИначеЕсли ТекущийОбъект.ТипНачисления = Перечисления.энргТипыНачислений.ОбщедомовыеНачисления Тогда
		ВидПлощадиУслуги 					= ТекущийОбъект.Услуга.ВидПлощадиМКД;
		СпособыРасчетаПоНаправлениям 		= РегистрыСведений.энргСпособыРасчетаПоНаправлениям.СрезПоследних(Объект.Дата,Новый Структура("Организация, Район, Услуга, НаправлениеИспользованияТУ", ТекущийОбъект.Организация, ТекущийОбъект.Район, ТекущийОбъект.Услуга, ТекущийОбъект.НаправлениеИспользованияТУ));
		ЕдиницаИзмеренияЗнаменатель 		= Справочники.энргЕдиницыИзмерения.ПустаяСсылка();
		Если НЕ СпособыРасчетаПоНаправлениям.Количество() = 0 Тогда
			ЕдиницаИзмеренияЗнаменатель 	= СпособыРасчетаПоНаправлениям[0].ЗнаменательЕдиницыИзмерения;	
		КонецЕсли;
	КонецЕсли;
	
	НаименованиеУслуги						= ТекущийОбъект.Услуга.Наименование;
	
	КлючевыеПараметрыНорматива				= Перечисления.энргКлючевыеПараметрыНорматива.ОписаниеКлючевыхПараметров();
	ЗначенияПараметров  					= Неопределено;
	//ЗаполнятьЗначенияПараметров  			= Истина;			
		
	КлючевыеПараметрыУслугиСтруткура		= КлючевыеПараметрыУслуги(ТекущийОбъект);
	
	Для Каждого ТекКлючевыеПараметрыУслуги Из КлючевыеПараметрыУслугиСтруткура Цикл 
		КлючевыеПараметрыУслуги 			= ТекКлючевыеПараметрыУслуги.Значение;
		НазваниеЭлемента					= ТекКлючевыеПараметрыУслуги.Ключ;
		
		Если НазваниеЭлемента = "КлючевыеПараметрыСоцНорматива" Тогда
			ТекСписокКлючевыхПараметров 	= СписокКлючевыхПараметровСоцНорматива;
			НазваниеНовогоЭлемента			= "КлючевойПараметрЗначениеСоцНорматива";
		Иначе                              
			ТекСписокКлючевыхПараметров 	= СписокКлючевыхПараметров;	
			НазваниеНовогоЭлемента			= "КлючевойПараметрЗначениеНорматива";
		КонецЕсли;
		
		ЭлементЗначениеНорматива  				=  Элементы.Найти(НазваниеНовогоЭлемента);
		Если НЕ ЭлементЗначениеНорматива = Неопределено Тогда
			Элементы.Удалить(ЭлементЗначениеНорматива);
		КонецЕсли;
		
		МассивРеквизитов 						= Новый Массив;
		МассивРеквизитовУдалить 				= Новый Массив;
		МассивСписокКлючПарУдалить 				= новый Массив;
		
		Для Каждого КлючевойПараметр Из ТекСписокКлючевыхПараметров Цикл
			Если НЕ КлючевыеПараметрыУслуги.Найти(КлючевойПараметр.Значение) = Неопределено Тогда				
				Продолжить;
			КонецЕсли;		
			//ОписаниеПараметра 					= КлючевыеПараметрыНорматива[КлючевойПараметр.Значение];
			//ПолеТаблицы 						= Новый РеквизитФормы(ОписаниеПараметра.Имя, ОписаниеПараметра.Тип, НазваниеЭлемента, ОписаниеПараметра.Заголовок);			
			//МассивРеквизитовУдалить.Добавить(ПолеТаблицы.Путь + "." + ПолеТаблицы.Имя);
			
			ОписаниеПараметра 					= КлючевыеПараметрыНорматива[КлючевойПараметр.Значение];
			
			Если ОписаниеПараметра.Диапазон Тогда			
				ПолеТаблицы 					= Новый РеквизитФормы(ОписаниеПараметра.Имя + "От", ОписаниеПараметра.Тип, НазваниеЭлемента, ОписаниеПараметра.Заголовок + " от");
				МассивРеквизитовУдалить.Добавить(ПолеТаблицы.Путь + "." + ПолеТаблицы.Имя);
				
				ПолеТаблицы 					= Новый РеквизитФормы(ОписаниеПараметра.Имя + "До", ОписаниеПараметра.Тип, НазваниеЭлемента, ОписаниеПараметра.Заголовок + " до");
				МассивРеквизитовУдалить.Добавить(ПолеТаблицы.Путь + "." + ПолеТаблицы.Имя); 			
			Иначе 			
				ПолеТаблицы 					= Новый РеквизитФормы(ОписаниеПараметра.Имя, ОписаниеПараметра.Тип, НазваниеЭлемента, ОписаниеПараметра.Заголовок);
				МассивРеквизитовУдалить.Добавить(ПолеТаблицы.Путь + "." + ПолеТаблицы.Имя);	
			КонецЕсли;
			
			МассивСписокКлючПарУдалить.Добавить(КлючевойПараметр);
		КонецЦикла;
		
		//Для Каждого ПараметрДляУдаления из МассивСписокКлючПарУдалить Цикл
		//	СписокКлючевыхПараметров.Удалить(ПараметрДляУдаления);
		//КонецЦикла; 		
		
		Для Каждого ПараметрДляУдаления из МассивСписокКлючПарУдалить Цикл
			Если НазваниеЭлемента = "КлючевыеПараметрыСоцНорматива" Тогда
				СписокКлючевыхПараметровСоцНорматива.Удалить(ПараметрДляУдаления);
			Иначе
				СписокКлючевыхПараметров.Удалить(ПараметрДляУдаления);
			КонецЕсли;
		КонецЦикла;
		
		Для Каждого КлючевойПараметр Из КлючевыеПараметрыУслуги Цикл		
			Если НЕ ТекСписокКлючевыхПараметров.НайтиПоЗначению(КлючевойПараметр) = Неопределено Тогда
				Продолжить;
			КонецЕсли;		
			// Норматив не от чего не зависит (только от района)
			//ТекСписокКлючевыхПараметров.Добавить(КлючевойПараметр);
			Если КлючевойПараметр = Перечисления.энргКлючевыеПараметрыНорматива.ПустаяСсылка() Тогда
				Продолжить;
			КонецЕсли;
			
			ОписаниеПараметра 					= КлючевыеПараметрыНорматива[КлючевойПараметр];
			
			Если ОписаниеПараметра.Диапазон Тогда			
				ПолеТаблицы 					= Новый РеквизитФормы(ОписаниеПараметра.Имя + "От", ОписаниеПараметра.Тип, НазваниеЭлемента, ОписаниеПараметра.Заголовок + " от");
				МассивРеквизитов.Добавить(ПолеТаблицы);
				
				ОписаниеПараметра 				= КлючевыеПараметрыНорматива[КлючевойПараметр];
				ПолеТаблицы 					= Новый РеквизитФормы(ОписаниеПараметра.Имя + "До", ОписаниеПараметра.Тип, НазваниеЭлемента, ОписаниеПараметра.Заголовок + " до");
				МассивРеквизитов.Добавить(ПолеТаблицы); 			
			Иначе 			
				ПолеТаблицы 					= Новый РеквизитФормы(ОписаниеПараметра.Имя, ОписаниеПараметра.Тип, НазваниеЭлемента, ОписаниеПараметра.Заголовок);
				МассивРеквизитов.Добавить(ПолеТаблицы);	
			КонецЕсли;
		КонецЦикла;
		
		ДобавитьЭлементыФормы  					= ложь;
		
		Если МассивРеквизитов.Количество() > 0 ИЛИ МассивРеквизитовУдалить.Количество() > 0 Тогда
			ИзменитьРеквизиты(МассивРеквизитов, МассивРеквизитовУдалить);
			ДобавитьЭлементыФормы 			= Истина;
		КонецЕсли;
		
		Если ДобавитьЭлементыФормы Тогда
			Порядок 							= 0;
			
			Для Каждого КлючевойПараметр Из КлючевыеПараметрыУслуги Цикл
				
				Если НЕ ТекСписокКлючевыхПараметров.НайтиПоЗначению(КлючевойПараметр) = Неопределено Тогда
					Продолжить;
				КонецЕсли;
				ТекСписокКлючевыхПараметров.Добавить(КлючевойПараметр);
	
				ОписаниеПараметра 				= КлючевыеПараметрыНорматива[КлючевойПараметр];
				Если ОписаниеПараметра.Диапазон Тогда
					ПолеТаблицы 				= Элементы.Добавить(НазваниеЭлемента + ОписаниеПараметра.Имя + "От", Тип("ПолеФормы"), Элементы[НазваниеЭлемента]);
					ПолеТаблицы.Вид 			= ВидПоляФормы.ПолеВвода;
					ПолеТаблицы.ПутьКДанным  	= НазваниеЭлемента + "." + ОписаниеПараметра.Имя + "От";
					
					Элементы.Переместить(ПолеТаблицы,Элементы[НазваниеЭлемента],Элементы[НазваниеЭлемента+ "ГруппаЕдиницыИзмерения"]);
					
					ПолеТаблицы 				= Элементы.Добавить(НазваниеЭлемента + ОписаниеПараметра.Имя + "До", Тип("ПолеФормы"), Элементы[НазваниеЭлемента]);
					ПолеТаблицы.Вид 			= ВидПоляФормы.ПолеВвода;
					ПолеТаблицы.ПутьКДанным  	= НазваниеЭлемента + "." + ОписаниеПараметра.Имя + "До";
					
					Элементы.Переместить(ПолеТаблицы,Элементы[НазваниеЭлемента],Элементы[НазваниеЭлемента+ "ГруппаЕдиницыИзмерения"]);
				Иначе				
					ПолеТаблицы 				= Элементы.Добавить(НазваниеЭлемента + ОписаниеПараметра.Имя, Тип("ПолеФормы"), Элементы[НазваниеЭлемента]);
					ПолеТаблицы.Вид 			= ВидПоляФормы.ПолеВвода;
					ПолеТаблицы.ПутьКДанным  	= НазваниеЭлемента + "." + ОписаниеПараметра.Имя;
					//Если ОписаниеПараметра.Имя = "ВидБлагоустройства" Тогда
					//	ПолеТаблицы.УстановитьДействие("НачалоВыбора", "НачалоВыбораВидБлагоустройства");
					//КонецЕсли;
					
					Элементы.Переместить(ПолеТаблицы,Элементы[НазваниеЭлемента],Элементы[НазваниеЭлемента+ "ГруппаЕдиницыИзмерения"]);
				КонецЕсли;
				
				Если ОписаниеПараметра.ИспользоватьСвязиПараметровВыбора Тогда
					ЗадатьСвязиПараметровВыбора(ПолеТаблицы,ОписаниеПараметра.Имя);
				КонецЕсли;
				
			КонецЦикла;		
		КонецЕсли;                                                                        
		
		ПолеТаблицы						= Элементы.Добавить(НазваниеНовогоЭлемента, Тип("ПолеФормы"), Элементы[НазваниеЭлемента]);
		ПолеТаблицы.Вид 				= ВидПоляФормы.ПолеВвода;
		ПолеТаблицы.ПутьКДанным  		= НазваниеЭлемента + "." + "ЗначениеНорматива";
		Элементы.Переместить(ПолеТаблицы,Элементы[НазваниеЭлемента],Элементы[НазваниеЭлемента+ "ГруппаЕдиницыИзмерения"]);
		
		Если ЗаполнятьЗначенияПараметров Тогда
			ЗаполнитьЗначенияПараметровПоКлючам(ТекущийОбъект, НазваниеЭлемента);
		КонецЕсли;
	КонецЦикла;

КонецПроцедуры

&НаСервере
Процедура ЗаполнитьЗначенияПараметровПоКлючам(ТекущийОбъект, НазваниеЭлемента)
	Запрос  						= Новый Запрос;
	Запрос.УстановитьПараметр("Услуга", 	ТекущийОбъект.Услуга);
	
	Если ТекущийОбъект.НаправлениеИспользованияТУ = Справочники.энргНаправлениеИспользованияТочекУчета.ОсновноеНаправление Тогда	
		Запрос.УстановитьПараметр("ВидПлощади", ТекущийОбъект.Услуга.ВидПлощади);
	Иначе
		ВидПлощади = Неопределено;
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	энргСпособыРасчетаПоНаправлениямСрезПоследних.ВидПлощади КАК ВидПлощади
		|ИЗ
		|	РегистрСведений.энргСпособыРасчетаПоНаправлениям.СрезПоследних(
		|			&Дата,
		|			НаправлениеИспользованияТУ = &НаправлениеИспользованияТУ
		|				И Услуга = &Услуга) КАК энргСпособыРасчетаПоНаправлениямСрезПоследних
		|ГДЕ
		|	энргСпособыРасчетаПоНаправлениямСрезПоследних.Услуга = &Услуга
		|	И энргСпособыРасчетаПоНаправлениямСрезПоследних.НаправлениеИспользованияТУ = &НаправлениеИспользованияТУ";
		
		Запрос.УстановитьПараметр("НаправлениеИспользованияТУ", ТекущийОбъект.НаправлениеИспользованияТУ);
		Запрос.УстановитьПараметр("Услуга", ТекущийОбъект.Услуга);
		Запрос.УстановитьПараметр("Дата", 	ТекущийОбъект.Дата);

		
		РезультатЗапроса = Запрос.Выполнить();
		
		ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
		
		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
			ВидПлощади = ВыборкаДетальныеЗаписи.ВидПлощади;
		КонецЦикла;
		
		//СпособыРасчетаПоНаправлениям = РегистрыСведений.энргСпособыРасчетаПоНаправлениям.Получить(Новый Структура("Услуга, НаправлениеИспользованияТУ", ТекущийОбъект.Услуга, ТекущийОбъект.НаправлениеИспользованияТУ));
		//Запрос.УстановитьПараметр("ВидПлощади", СпособыРасчетаПоНаправлениям.ВидПлощади);
		
		Запрос.УстановитьПараметр("ВидПлощади", ВидПлощади);
	КонецЕсли;
	
	Если ТипЗнч(ТекущийОбъект) = Тип("ДанныеФормыСтруктура") Тогда
		
		Если НазваниеЭлемента = "КлючевыеПараметрыСоцНорматива" Тогда
			ЗначенияНормативов 		= ТекущийОбъект.ЗначенияСоциальныхНормативов.Выгрузить();
		Иначе
			ЗначенияНормативов 		= ТекущийОбъект.ЗначенияНормативов.Выгрузить();	
		КонецЕсли;				
		Запрос.УстановитьПараметр("ЗначенияНормативов", ЗначенияНормативов);
		
		Текст 					= 
		"ВЫБРАТЬ
		|	ЗначенияНормативов.КлючНорматива КАК КлючНорматива,
		|	ЗначенияНормативов.ЗначениеНорматива КАК ЗначениеНорматива
		|ПОМЕСТИТЬ ЗначенияНормативов
		|ИЗ
		|	&ЗначенияНормативов КАК ЗначенияНормативов
		|;
		|//
		|ВЫБРАТЬ
		|	энргКлючиНормативов.*,
		|	&Услуга КАК Услуга,
		|	&ВидПлощади КАК ВидПлощади,
		|	ЗначенияНормативов.ЗначениеНорматива КАК ЗначениеНорматива
		|ИЗ
		|	Справочник.энргКлючиНормативов КАК энргКлючиНормативов
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ЗначенияНормативов КАК ЗначенияНормативов
		|		ПО энргКлючиНормативов.Ссылка = ЗначенияНормативов.КлючНорматива";		
	Иначе		
		Запрос.УстановитьПараметр("Ссылка", ТекущийОбъект.Ссылка);
		Текст 					=
		"ВЫБРАТЬ
		|	энргКлючиНормативов.*,
		|	&Услуга КАК Услуга,
		|	&ВидПлощади КАК ВидПлощади,
		|	энргУстановитьНормуПотребленияПоУслугеЗначенияНормативов.ЗначениеНорматива КАК ЗначениеНорматива
		|ИЗ
		|	Справочник.энргКлючиНормативов КАК энргКлючиНормативов
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.энргУстановитьНормуПотребленияПоУслуге.ЗначенияНормативов КАК энргУстановитьНормуПотребленияПоУслугеЗначенияНормативов
		|		ПО энргКлючиНормативов.Ссылка = энргУстановитьНормуПотребленияПоУслугеЗначенияНормативов.КлючНорматива
		|			И (энргУстановитьНормуПотребленияПоУслугеЗначенияНормативов.Ссылка = &Ссылка)";
		
		Если НазваниеЭлемента = "КлючевыеПараметрыСоцНорматива" Тогда
			Текст = СтрЗаменить(Текст, "ЗначенияНормативов", "ЗначенияСоциальныхНормативов");
		КонецЕсли;
	КонецЕсли;
	
	Запрос.Текст 			= Текст;
	Результат  				= Запрос.Выполнить();
	Выборка  				= Результат.Выбрать();
	Пока Выборка.Следующий() цикл
		ЗаполнитьЗначенияСвойств(ЭтаФорма[НазваниеЭлемента].Добавить(),Выборка);
	КонецЦикла;

КонецПроцедуры

&НаСервере
Функция КлючевыеПараметрыУслуги(ТекущийОбъект)
	
	Запрос  		= Новый Запрос;
	Запрос.УстановитьПараметр("Период", 		ТекущийОбъект.Дата);
	Запрос.УстановитьПараметр("Организация", 	ТекущийОбъект.Организация);
	Запрос.УстановитьПараметр("Район", 			ТекущийОбъект.Район);
	Запрос.УстановитьПараметр("Услуга", 		ТекущийОбъект.Услуга);
	Запрос.УстановитьПараметр("ТипНачисления", 	ТекущийОбъект.ТипНачисления);
	Запрос.УстановитьПараметр("НаправлениеИспользованияТУ", 	ТекущийОбъект.НаправлениеИспользованияТУ);
	Запрос.Текст 	=
	"ВЫБРАТЬ
	|	МАКСИМУМ(энргУстановленныеПараметрыРасчетаНормативаСрезПоследних.Период) КАК Период,
	|	энргУстановленныеПараметрыРасчетаНормативаСрезПоследних.СоциальныйНорматив КАК СоциальныйНорматив,
	|	энргУстановленныеПараметрыРасчетаНормативаСрезПоследних.Организация КАК Организация,
	|	энргУстановленныеПараметрыРасчетаНормативаСрезПоследних.Район КАК Район,
	|	энргУстановленныеПараметрыРасчетаНормативаСрезПоследних.ТипНачисления КАК ТипНачисления,
	|	энргУстановленныеПараметрыРасчетаНормативаСрезПоследних.Услуга КАК Услуга,
	|	энргУстановленныеПараметрыРасчетаНормативаСрезПоследних.НаправлениеИспользованияТУ КАК НаправлениеИспользованияТУ
	|ПОМЕСТИТЬ ВТ_МаксималтныйПериод
	|ИЗ
	|	РегистрСведений.энргУстановленныеПараметрыРасчетаНорматива.СрезПоследних(
	|			&Период,
	|			Организация = &Организация
	|				И Район = &Район
	|				И Услуга = &Услуга
	|				И ТипНачисления = &ТипНачисления
	|				И НаправлениеИспользованияТУ = &НаправлениеИспользованияТУ) КАК энргУстановленныеПараметрыРасчетаНормативаСрезПоследних
	|
	|СГРУППИРОВАТЬ ПО
	|	энргУстановленныеПараметрыРасчетаНормативаСрезПоследних.СоциальныйНорматив,
	|	энргУстановленныеПараметрыРасчетаНормативаСрезПоследних.Организация,
	|	энргУстановленныеПараметрыРасчетаНормативаСрезПоследних.Район,
	|	энргУстановленныеПараметрыРасчетаНормативаСрезПоследних.ТипНачисления,
	|	энргУстановленныеПараметрыРасчетаНормативаСрезПоследних.Услуга,
	|	энргУстановленныеПараметрыРасчетаНормативаСрезПоследних.НаправлениеИспользованияТУ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВЫБОР
	|		КОГДА НЕ энргУстановленныеПараметрыРасчетаНормативаСрезПоследних.СоциальныйНорматив
	|			ТОГДА энргУстановленныеПараметрыРасчетаНормативаСрезПоследних.Разрез
	|		ИНАЧЕ ЗНАЧЕНИЕ(перечисление.энргКлючевыеПараметрыНорматива.ПустаяСсылка)
	|	КОНЕЦ КАК Разрез,
	|	ВЫБОР
	|		КОГДА энргУстановленныеПараметрыРасчетаНормативаСрезПоследних.СоциальныйНорматив
	|			ТОГДА энргУстановленныеПараметрыРасчетаНормативаСрезПоследних.Разрез
	|		ИНАЧЕ ЗНАЧЕНИЕ(перечисление.энргКлючевыеПараметрыНорматива.ПустаяСсылка)
	|	КОНЕЦ КАК РазрезСоцНорматива
	|ИЗ
	|	РегистрСведений.энргУстановленныеПараметрыРасчетаНорматива КАК энргУстановленныеПараметрыРасчетаНормативаСрезПоследних
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_МаксималтныйПериод КАК ВТ_МаксималтныйПериод
	|		ПО энргУстановленныеПараметрыРасчетаНормативаСрезПоследних.Период = ВТ_МаксималтныйПериод.Период
	|			И энргУстановленныеПараметрыРасчетаНормативаСрезПоследних.СоциальныйНорматив = ВТ_МаксималтныйПериод.СоциальныйНорматив
	|			И энргУстановленныеПараметрыРасчетаНормативаСрезПоследних.Организация = ВТ_МаксималтныйПериод.Организация
	|			И энргУстановленныеПараметрыРасчетаНормативаСрезПоследних.Район = ВТ_МаксималтныйПериод.Район
	|			И энргУстановленныеПараметрыРасчетаНормативаСрезПоследних.ТипНачисления = ВТ_МаксималтныйПериод.ТипНачисления
	|			И энргУстановленныеПараметрыРасчетаНормативаСрезПоследних.Услуга = ВТ_МаксималтныйПериод.Услуга
	|			И энргУстановленныеПараметрыРасчетаНормативаСрезПоследних.НаправлениеИспользованияТУ = ВТ_МаксималтныйПериод.НаправлениеИспользованияТУ";
	
	Результат  = Запрос.Выполнить().Выгрузить();
	Возврат Новый Структура("КлючевыеПараметры, КлючевыеПараметрыСоцНорматива", УдалитьПустыеЭлементы(Результат.ВыгрузитьКолонку("Разрез")), УдалитьПустыеЭлементы(Результат.ВыгрузитьКолонку("РазрезСоцНорматива")));
	
КонецФункции

&НаСервере
Функция УдалитьПустыеЭлементы(МассивЭлементов)
	
	Счетчик = 0;
	КоличествоЭлементов = МассивЭлементов.Количество();
	
	Пока Счетчик < КоличествоЭлементов Цикл
		
		Если МассивЭлементов [Счетчик].Пустая() Тогда
			МассивЭлементов.Удалить(Счетчик);
			
			КоличествоЭлементов = КоличествоЭлементов - 1;
			
		Иначе
			Счетчик = Счетчик + 1;
			
		КонецЕсли;
		
	КонецЦикла;
	Возврат МассивЭлементов;
КонецФункции

&НаКлиенте
Процедура КлючевыеПараметрыПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	ТекущиеДанные = Элементы.КлючевыеПараметры.ТекущиеДанные;
	
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ТекущиеДанные.Услуга 						= Объект.Услуга;
	ТекущиеДанные.ВидПлощади 					= ВидПлощадиУслуги;
	ТекущиеДанные.ЕдиницаИзмеренияЗнаменатель 	= ЕдиницаИзмеренияЗнаменатель;
КонецПроцедуры

Процедура ЗадатьСвязиПараметровВыбора(ПолеТаблицы,ИмяПараметра)
		
	Если ИмяПараметра = "ИзмерительНаправленияИспользования" Тогда
		НоваяСвязь 	= Новый СвязьПараметраВыбора("Отбор.Родитель", "Объект.НаправлениеИспользованияТУ");		
		НовыйМассив = Новый Массив();
		НовыйМассив.Добавить(НоваяСвязь);
		НовыеСвязи 	= Новый ФиксированныйМассив(НовыйМассив);
		
		ПолеТаблицы.СвязиПараметровВыбора = НовыеСвязи;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти
